; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (conn ?x ?y)
             (key-shape ?k ?s)
             (lock-shape ?x ?s)
             (at ?r ?x )
	     (at-robot ?x)
             (place ?p)
             (key ?k)
             (shape ?s)
             (locked ?x)
             (holding ?k)
             (open ?x)
             (arm-empty ))



(:action unlock
:parameters (?curpos ?lockpos ?key ?shape)
:precondition (and (place ?curpos) (place ?lockpos) (key ?key) (shape ?shape)
          (conn ?curpos ?lockpos) (key-shape ?key ?shape)
                   (lock-shape ?lockpos ?shape) (at-robot ?curpos) 
                   (locked ?lockpos) (holding ?key))
:effect (and  (open ?lockpos) (not (locked ?lockpos))))


(:action move
:parameters (?curpos ?nextpos)
:precondition (and (place ?curpos) (place ?nextpos)
               (at-robot ?curpos) (conn ?curpos ?nextpos) (open ?nextpos))
:effect (and (at-robot ?nextpos) (not (at-robot ?curpos))))

(:action pickup
:parameters (?curpos ?key)
:precondition (and (place ?curpos) (key ?key) 
                  (at-robot ?curpos) (at ?key ?curpos) (arm-empty ))
:effect (and (holding ?key)
   (not (at ?key ?curpos)) (not (arm-empty ))))


(:action pickup-and-loose
:parameters (?curpos ?newkey ?oldkey)
:precondition (and (place ?curpos) (key ?newkey) (key ?oldkey)
                  (at-robot ?curpos) (holding ?oldkey) (at ?newkey ?curpos))
:effect (and (holding ?newkey) (at ?oldkey ?curpos)
        (not (holding ?oldkey)) (not (at ?newkey ?curpos))))

(:action putdown
:parameters (?curpos ?key)
:precondition (and (place ?curpos) (key ?key) 
                  (at-robot ?curpos) (holding ?key))
:effect (and (arm-empty ) (at ?key ?curpos) (not (holding ?key)))))

; problem
(define (problem grid-6-6-4-6-6)
    (:domain grid)
    (:objects
    pos0-0 pos0-1 pos0-2 pos0-3 pos0-4 pos0-5 pos1-0 pos1-1 pos1-2 pos1-3 pos1-4 pos1-5 pos2-0 pos2-1 pos2-2 pos2-3 pos2-4 pos2-5 pos3-0 pos3-1 pos3-2 pos3-3 pos3-4 pos3-5 pos4-0 pos4-1 pos4-2 pos4-3 pos4-4 pos4-5 pos5-0 pos5-1 pos5-2 pos5-3 pos5-4 pos5-5
    shape0 shape1 shape2 shape3
    key0 key1 key2 key3 key4 key5
    )

    (:init
       (arm-empty)

       (place pos0-0)
       (place pos0-1)
       (place pos0-2)
       (place pos0-3)
       (place pos0-4)
       (place pos0-5)
       (place pos1-0)
       (place pos1-1)
       (place pos1-2)
       (place pos1-3)
       (place pos1-4)
       (place pos1-5)
       (place pos2-0)
       (place pos2-1)
       (place pos2-2)
       (place pos2-3)
       (place pos2-4)
       (place pos2-5)
       (place pos3-0)
       (place pos3-1)
       (place pos3-2)
       (place pos3-3)
       (place pos3-4)
       (place pos3-5)
       (place pos4-0)
       (place pos4-1)
       (place pos4-2)
       (place pos4-3)
       (place pos4-4)
       (place pos4-5)
       (place pos5-0)
       (place pos5-1)
       (place pos5-2)
       (place pos5-3)
       (place pos5-4)
       (place pos5-5)
       (shape shape0)
       (shape shape1)
       (shape shape2)
       (shape shape3)
       (key key0)
       (key key1)
       (key key2)
       (key key3)
       (key key4)
       (key key5)

       (conn pos0-0 pos1-0)
       (conn pos0-0 pos0-1)
       (conn pos0-1 pos1-1)
       (conn pos0-1 pos0-2)
       (conn pos0-1 pos0-0)
       (conn pos0-2 pos1-2)
       (conn pos0-2 pos0-3)
       (conn pos0-2 pos0-1)
       (conn pos0-3 pos1-3)
       (conn pos0-3 pos0-4)
       (conn pos0-3 pos0-2)
       (conn pos0-4 pos1-4)
       (conn pos0-4 pos0-5)
       (conn pos0-4 pos0-3)
       (conn pos0-5 pos1-5)
       (conn pos0-5 pos0-4)
       (conn pos1-0 pos2-0)
       (conn pos1-0 pos1-1)
       (conn pos1-0 pos0-0)
       (conn pos1-1 pos2-1)
       (conn pos1-1 pos1-2)
       (conn pos1-1 pos0-1)
       (conn pos1-1 pos1-0)
       (conn pos1-2 pos2-2)
       (conn pos1-2 pos1-3)
       (conn pos1-2 pos0-2)
       (conn pos1-2 pos1-1)
       (conn pos1-3 pos2-3)
       (conn pos1-3 pos1-4)
       (conn pos1-3 pos0-3)
       (conn pos1-3 pos1-2)
       (conn pos1-4 pos2-4)
       (conn pos1-4 pos1-5)
       (conn pos1-4 pos0-4)
       (conn pos1-4 pos1-3)
       (conn pos1-5 pos2-5)
       (conn pos1-5 pos0-5)
       (conn pos1-5 pos1-4)
       (conn pos2-0 pos3-0)
       (conn pos2-0 pos2-1)
       (conn pos2-0 pos1-0)
       (conn pos2-1 pos3-1)
       (conn pos2-1 pos2-2)
       (conn pos2-1 pos1-1)
       (conn pos2-1 pos2-0)
       (conn pos2-2 pos3-2)
       (conn pos2-2 pos2-3)
       (conn pos2-2 pos1-2)
       (conn pos2-2 pos2-1)
       (conn pos2-3 pos3-3)
       (conn pos2-3 pos2-4)
       (conn pos2-3 pos1-3)
       (conn pos2-3 pos2-2)
       (conn pos2-4 pos3-4)
       (conn pos2-4 pos2-5)
       (conn pos2-4 pos1-4)
       (conn pos2-4 pos2-3)
       (conn pos2-5 pos3-5)
       (conn pos2-5 pos1-5)
       (conn pos2-5 pos2-4)
       (conn pos3-0 pos4-0)
       (conn pos3-0 pos3-1)
       (conn pos3-0 pos2-0)
       (conn pos3-1 pos4-1)
       (conn pos3-1 pos3-2)
       (conn pos3-1 pos2-1)
       (conn pos3-1 pos3-0)
       (conn pos3-2 pos4-2)
       (conn pos3-2 pos3-3)
       (conn pos3-2 pos2-2)
       (conn pos3-2 pos3-1)
       (conn pos3-3 pos4-3)
       (conn pos3-3 pos3-4)
       (conn pos3-3 pos2-3)
       (conn pos3-3 pos3-2)
       (conn pos3-4 pos4-4)
       (conn pos3-4 pos3-5)
       (conn pos3-4 pos2-4)
       (conn pos3-4 pos3-3)
       (conn pos3-5 pos4-5)
       (conn pos3-5 pos2-5)
       (conn pos3-5 pos3-4)
       (conn pos4-0 pos5-0)
       (conn pos4-0 pos4-1)
       (conn pos4-0 pos3-0)
       (conn pos4-1 pos5-1)
       (conn pos4-1 pos4-2)
       (conn pos4-1 pos3-1)
       (conn pos4-1 pos4-0)
       (conn pos4-2 pos5-2)
       (conn pos4-2 pos4-3)
       (conn pos4-2 pos3-2)
       (conn pos4-2 pos4-1)
       (conn pos4-3 pos5-3)
       (conn pos4-3 pos4-4)
       (conn pos4-3 pos3-3)
       (conn pos4-3 pos4-2)
       (conn pos4-4 pos5-4)
       (conn pos4-4 pos4-5)
       (conn pos4-4 pos3-4)
       (conn pos4-4 pos4-3)
       (conn pos4-5 pos5-5)
       (conn pos4-5 pos3-5)
       (conn pos4-5 pos4-4)
       (conn pos5-0 pos5-1)
       (conn pos5-0 pos4-0)
       (conn pos5-1 pos5-2)
       (conn pos5-1 pos4-1)
       (conn pos5-1 pos5-0)
       (conn pos5-2 pos5-3)
       (conn pos5-2 pos4-2)
       (conn pos5-2 pos5-1)
       (conn pos5-3 pos5-4)
       (conn pos5-3 pos4-3)
       (conn pos5-3 pos5-2)
       (conn pos5-4 pos5-5)
       (conn pos5-4 pos4-4)
       (conn pos5-4 pos5-3)
       (conn pos5-5 pos4-5)
       (conn pos5-5 pos5-4)
       (locked pos5-1)
       (locked pos4-4)
       (locked pos1-3)
       (locked pos3-3)
       (locked pos1-5)
       (locked pos5-3)
       (lock-shape  pos5-1 shape0)
       (lock-shape  pos4-4 shape1)
       (lock-shape  pos1-3 shape2)
       (lock-shape  pos3-3 shape3)
       (lock-shape  pos1-5 shape1)
       (lock-shape  pos5-3 shape1)
       (open pos0-0)
       (open pos0-1)
       (open pos0-2)
       (open pos0-3)
       (open pos0-4)
       (open pos0-5)
       (open pos1-0)
       (open pos1-1)
       (open pos1-2)
       (open pos1-4)
       (open pos2-0)
       (open pos2-1)
       (open pos2-2)
       (open pos2-3)
       (open pos2-4)
       (open pos2-5)
       (open pos3-0)
       (open pos3-1)
       (open pos3-2)
       (open pos3-4)
       (open pos3-5)
       (open pos4-0)
       (open pos4-1)
       (open pos4-2)
       (open pos4-3)
       (open pos4-5)
       (open pos5-0)
       (open pos5-2)
       (open pos5-4)
       (open pos5-5)

       (key-shape  key0 shape0)
       (key-shape  key1 shape1)
       (key-shape  key2 shape2)
       (key-shape  key3 shape3)
       (key-shape  key4 shape0)
       (key-shape  key5 shape1)
       (at key0 pos0-4)
       (at key1 pos0-5)
       (at key2 pos5-0)
       (at key3 pos3-4)
       (at key4 pos1-0)
       (at key5 pos2-4)
       (at-robot pos2-3)
    )

    (:goal (and
       (at key0 pos3-4)
       (at key1 pos1-2)
       (at key2 pos2-2)
       (at key4 pos5-1)
       (at key5 pos3-5)
    ))
(:constraints
  (always (not (at-robot pos3-2)))
)
)

; plan
1. (move pos2-3 pos2-4)
   deleted: (at-robot pos2-3)
   added: (at-robot pos2-4)
   goals met: 0 of 5
2. (pickup pos2-4 key5)
   deleted: (at key5 pos2-4) (arm-empty)
   added: (holding key5)
   goals met: 0 of 5
3. (move pos2-4 pos3-4)
   deleted: (at-robot pos2-4)
   added: (at-robot pos3-4)
   goals met: 0 of 5
4. (unlock pos3-4 pos4-4 key5 shape1)
   deleted: (locked pos4-4)
   added: (open pos4-4)
   goals met: 0 of 5
5. (move pos3-4 pos3-5)
   deleted: (at-robot pos3-4)
   added: (at-robot pos3-5)
   goals met: 0 of 5
6. (putdown pos3-5 key5)
   deleted: (holding key5)
   added: (arm-empty) (at key5 pos3-5)
   goals met: 1 of 5
7. (move pos3-5 pos3-4)
   deleted: (at-robot pos3-5)
   added: (at-robot pos3-4)
   goals met: 1 of 5
8. (move pos3-4 pos2-4)
   deleted: (at-robot pos3-4)
   added: (at-robot pos2-4)
   goals met: 1 of 5
9. (move pos2-4 pos1-4)
   deleted: (at-robot pos2-4)
   added: (at-robot pos1-4)
   goals met: 1 of 5
10. (move pos1-4 pos0-4)
   deleted: (at-robot pos1-4)
   added: (at-robot pos0-4)
   goals met: 1 of 5
11. (move pos0-4 pos0-5)
   deleted: (at-robot pos0-4)
   added: (at-robot pos0-5)
   goals met: 1 of 5
12. (pickup pos0-5 key1)
   deleted: (at key1 pos0-5) (arm-empty)
   added: (holding key1)
   goals met: 1 of 5
13. (move pos0-5 pos0-4)
   deleted: (at-robot pos0-5)
   added: (at-robot pos0-4)
   goals met: 1 of 5
14. (move pos0-4 pos1-4)
   deleted: (at-robot pos0-4)
   added: (at-robot pos1-4)
   goals met: 1 of 5
15. (move pos1-4 pos2-4)
   deleted: (at-robot pos1-4)
   added: (at-robot pos2-4)
   goals met: 1 of 5
16. (move pos2-4 pos2-3)
   deleted: (at-robot pos2-4)
   added: (at-robot pos2-3)
   goals met: 1 of 5
17. (move pos2-3 pos2-2)
   deleted: (at-robot pos2-3)
   added: (at-robot pos2-2)
   goals met: 1 of 5
18. (move pos2-2 pos1-2)
   deleted: (at-robot pos2-2)
   added: (at-robot pos1-2)
   goals met: 1 of 5
19. (putdown pos1-2 key1)
   deleted: (holding key1)
   added: (arm-empty) (at key1 pos1-2)
   goals met: 2 of 5
20. (move pos1-2 pos0-2)
   deleted: (at-robot pos1-2)
   added: (at-robot pos0-2)
   goals met: 2 of 5
21. (move pos0-2 pos0-3)
   deleted: (at-robot pos0-2)
   added: (at-robot pos0-3)
   goals met: 2 of 5
22. (move pos0-3 pos0-4)
   deleted: (at-robot pos0-3)
   added: (at-robot pos0-4)
   goals met: 2 of 5
23. (pickup pos0-4 key0)
   deleted: (at key0 pos0-4) (arm-empty)
   added: (holding key0)
   goals met: 2 of 5
24. (move pos0-4 pos1-4)
   deleted: (at-robot pos0-4)
   added: (at-robot pos1-4)
   goals met: 2 of 5
25. (move pos1-4 pos2-4)
   deleted: (at-robot pos1-4)
   added: (at-robot pos2-4)
   goals met: 2 of 5
26. (move pos2-4 pos3-4)
   deleted: (at-robot pos2-4)
   added: (at-robot pos3-4)
   goals met: 2 of 5
27. (putdown pos3-4 key0)
   deleted: (holding key0)
   added: (arm-empty) (at key0 pos3-4)
   goals met: 3 of 5
28. (move pos3-4 pos4-4)
   deleted: (at-robot pos3-4)
   added: (at-robot pos4-4)
   goals met: 3 of 5
29. (move pos4-4 pos4-3)
   deleted: (at-robot pos4-4)
   added: (at-robot pos4-3)
   goals met: 3 of 5
30. (move pos4-3 pos4-2)
   deleted: (at-robot pos4-3)
   added: (at-robot pos4-2)
   goals met: 3 of 5
31. (move pos4-2 pos4-1)
   deleted: (at-robot pos4-2)
   added: (at-robot pos4-1)
   goals met: 3 of 5
32. (move pos4-1 pos4-0)
   deleted: (at-robot pos4-1)
   added: (at-robot pos4-0)
   goals met: 3 of 5
33. (move pos4-0 pos5-0)
   deleted: (at-robot pos4-0)
   added: (at-robot pos5-0)
   goals met: 3 of 5
34. (pickup pos5-0 key2)
   deleted: (at key2 pos5-0) (arm-empty)
   added: (holding key2)
   goals met: 3 of 5
35. (move pos5-0 pos4-0)
   deleted: (at-robot pos5-0)
   added: (at-robot pos4-0)
   goals met: 3 of 5
36. (move pos4-0 pos4-1)
   deleted: (at-robot pos4-0)
   added: (at-robot pos4-1)
   goals met: 3 of 5
37. (move pos4-1 pos3-1)
   deleted: (at-robot pos4-1)
   added: (at-robot pos3-1)
   goals met: 3 of 5
38. (move pos3-1 pos2-1)
   deleted: (at-robot pos3-1)
   added: (at-robot pos2-1)
   goals met: 3 of 5
39. (move pos2-1 pos2-2)
   deleted: (at-robot pos2-1)
   added: (at-robot pos2-2)
   goals met: 3 of 5
40. (putdown pos2-2 key2)
   deleted: (holding key2)
   added: (arm-empty) (at key2 pos2-2)
   goals met: 4 of 5
41. (move pos2-2 pos2-1)
   deleted: (at-robot pos2-2)
   added: (at-robot pos2-1)
   goals met: 4 of 5
42. (move pos2-1 pos1-1)
   deleted: (at-robot pos2-1)
   added: (at-robot pos1-1)
   goals met: 4 of 5
43. (move pos1-1 pos1-0)
   deleted: (at-robot pos1-1)
   added: (at-robot pos1-0)
   goals met: 4 of 5
44. (pickup pos1-0 key4)
   deleted: (at key4 pos1-0) (arm-empty)
   added: (holding key4)
   goals met: 4 of 5
45. (move pos1-0 pos1-1)
   deleted: (at-robot pos1-0)
   added: (at-robot pos1-1)
   goals met: 4 of 5
46. (move pos1-1 pos2-1)
   deleted: (at-robot pos1-1)
   added: (at-robot pos2-1)
   goals met: 4 of 5
47. (move pos2-1 pos3-1)
   deleted: (at-robot pos2-1)
   added: (at-robot pos3-1)
   goals met: 4 of 5
48. (move pos3-1 pos4-1)
   deleted: (at-robot pos3-1)
   added: (at-robot pos4-1)
   goals met: 4 of 5
49. (unlock pos4-1 pos5-1 key4 shape0)
   deleted: (locked pos5-1)
   added: (open pos5-1)
   goals met: 4 of 5
50. (move pos4-1 pos5-1)
   deleted: (at-robot pos4-1)
   added: (at-robot pos5-1)
   goals met: 4 of 5
51. (putdown pos5-1 key4)
   deleted: (holding key4)
   added: (arm-empty) (at key4 pos5-1)
   goals met: 5 of 5
